Documents/Операция.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>Операция</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДвижениеДенегПоСчетам</xr:Item>
				<xr:Item>AccumulationRegister.Взаиморасчеты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДанныеОперации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Счета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статья</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДоходов</v8:Type>
								<v8:Type>cfg:CatalogRef.СтатьиРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетПеремещения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Счета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контакт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контакты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ТипыОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ТипыОпераций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перевод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Остаток</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Операция/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Пользователь = ПараметрыСеанса.ТекущийПользователь;	
		
		Если ЭтаФорма.Параметры.ТипОперации <> "" Тогда
			Объект.ТипОперации = Перечисления.ТипыОпераций[ЭтаФорма.Параметры.ТипОперации];
		КонецЕсли; 
	КонецЕсли;
	
	УправлениеВидимостью();
	
КонецПроцедуры

&НаКлиенте
Процедура ТипОперацииПриИзменении(Элемент)
	
	УправлениеВидимостью();
	
КонецПроцедуры

Процедура УправлениеВидимостью()

	Элементы.ДанныеОперацииСчетПеремещения.Видимость = Ложь;
	Элементы.ДанныеОперацииСтатья.Видимость = Ложь;
	
	Если Объект.ТипОперации = Перечисления.ТипыОпераций.Приход Тогда
		
		Элементы.ДанныеОперацииКонтакт.Заголовок = "Плательщик";
		Элементы.ДанныеОперацииСтатья.Видимость = Истина;
		Элементы.ДанныеОперацииСтатья.Заголовок = "Статья дохода";
		
		Элементы.ДанныеОперацииСтатья.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.СтатьиДоходов");

	ИначеЕсли Объект.ТипОперации = Перечисления.ТипыОпераций.Расход Тогда
		
		Элементы.ДанныеОперацииКонтакт.Заголовок = "Получатель";
		Элементы.ДанныеОперацииСтатья.Видимость = Истина;
		Элементы.ДанныеОперацииСтатья.Заголовок = "Статья расхода";
		
		Элементы.ДанныеОперацииСтатья.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.СтатьиРасходов");
		
	ИначеЕсли Объект.ТипОперации = Перечисления.ТипыОпераций.Перевод Тогда
		Элементы.ДанныеОперацииКонтакт.Видимость = Ложь;
		Элементы.ДанныеОперацииСчетПеремещения.Видимость = Истина;
	ИначеЕсли Объект.ТипОперации = Перечисления.ТипыОпераций.ОбменВалюты Тогда
		Элементы.ДанныеОперацииКонтакт.Видимость = Ложь;
		Элементы.ДанныеОперацииСчетПеремещения.Видимость = Истина;
	ИначеЕсли Объект.ТипОперации = Перечисления.ТипыОпераций.МыВзялиВДолг Тогда
		Элементы.ДанныеОперацииКонтакт.Видимость = Истина;
		Элементы.ДанныеОперацииКонтакт.Заголовок = "У кого взяли";
	ИначеЕсли Объект.ТипОперации = Перечисления.ТипыОпераций.МыВернулиДолг Тогда
		Элементы.ДанныеОперацииКонтакт.Видимость = Истина;
		Элементы.ДанныеОперацииКонтакт.Заголовок = "Кому вернули";
	ИначеЕсли Объект.ТипОперации = Перечисления.ТипыОпераций.МыДалиВДолг Тогда
		Элементы.ДанныеОперацииКонтакт.Видимость = Истина;
		Элементы.ДанныеОперацииКонтакт.Заголовок = "Кому дали";
	ИначеЕсли Объект.ТипОперации = Перечисления.ТипыОпераций.НамВернулиДолг Тогда
		Элементы.ДанныеОперацииКонтакт.Видимость = Истина;
		Элементы.ДанныеОперацииКонтакт.Заголовок = "Кто вернул";
	ИначеЕсли Объект.ТипОперации = Перечисления.ТипыОпераций.ВводОстатка Тогда
		Элементы.ДанныеОперацииКонтакт.Видимость = Ложь;
	КонецЕсли; 	

КонецПроцедуры
